export interface IQuestion {
  id: number;
  category: string;
  question: string;
  answer: string;
}

export const questions: IQuestion[] = [
  // 1. Факты, привычки, характер
  {
    id: 1,
    category: "Факты и характер",
    question: "Какой у Жени любимый вид спорта?",
    answer: "Бокс и качалка",
  },
  {
    id: 2,
    category: "Факты и характер",
    question: "Что Женя скорее выберет: остаться дома или куда-нибудь поехать?",
    answer: "Поехать на море",
  },
  {
    id: 3,
    category: "Факты и характер",
    question: "Какую вещь Женя терпеть не может делать по дому?",
    answer: "Убираться",
  },
  {
    id: 4,
    category: "Факты и характер",
    question: "Какую фразу Женя говорит чаще всего?",
    answer: "Пошли в кальянку",
  },
  {
    id: 5,
    category: "Факты и характер",
    question:
      "Какую одну вещь Женя точно взял бы с собой на необитаемый остров?",
    answer: "Обитаемый остров",
  },

  // 2. Музыка
  {
    id: 6,
    category: "Музыка",
    question: "Какой музыкальный жанр Женя слушает чаще всего?",
    answer: "Бандитский рэп",
  },
  {
    id: 7,
    category: "Музыка",
    question: "Какую песню Женя может узнать с первых секунд?",
    answer: "You Gon'Learn",
  },
  {
    id: 8,
    category: "Музыка",
    question: "Какого исполнителя Женя точно не станет добровольно слушать?",
    answer: "Всех тех гундежных, кого включает Аня в машине",
  },
  {
    id: 9,
    category: "Музыка",
    question: "Какая песня больше всего не подходит Жене по характеру?",
    answer: "Любая гундежная",
  },
  {
    id: 10,
    category: "Музыка",
    question: "Угадайте песню по 5-10 секундам трека",
    answer: "Трек, который ассоциируется с Женей",
  },

  // 3. Личная жизнь Дона Евгения
  {
    id: 11,
    category: "Личная жизнь",
    question: "Где Женя впервые встретил Анну?",
    answer: "В винчике",
  },
  {
    id: 12,
    category: "Личная жизнь",
    question: "Сколько лет они вместе?",
    answer: "7",
  },
  {
    id: 13,
    category: "Личная жизнь",
    question: "Кто первым сделал шаг в отношениях?",
    answer: "Данич",
  },
  {
    id: 14,
    category: "Личная жизнь",
    question:
      "Из-за какой бытовой мелочи Женя и Аня чаще всего могут поспорить?",
    answer: "Из-за спора",
  },
  {
    id: 15,
    category: "Личная жизнь",
    question:
      "Что Женя сделал на первом свидании, после чего Аня поняла: «Этот парень мне нравится»?",
    answer: "Сказав 'Извини' ударил зонтом",
  },

  // 4. Спорт, работа, друзья
  {
    id: 16,
    category: "Спорт и работа",
    question: "Чем Женя сейчас увлекается?",
    answer: "Бокс",
  },
  {
    id: 17,
    category: "Спорт и работа",
    question: "Что Женя выберет: бокс или футбол?",
    answer: "Бокс",
  },
  {
    id: 18,
    category: "Спорт и работа",
    question: "Что Женя делает первым делом после работы?",
    answer: "Идёт в душ",
  },
  {
    id: 19,
    category: "Спорт и работа",
    question: "Какая ситуация способна вывести Женю из себя быстрее всего?",
    answer: "Отказ от кальянки",
  },
  {
    id: 20,
    category: "Спорт и работа",
    question: "Женя выиграл 1 000 000 ₽. На что потратит первым делом?",
    answer: "На донат в Demon Slayer",
  },

  // 5. Реакции и повадки
  {
    id: 21,
    category: "Реакции и повадки",
    question: "Что Женя делает, когда не знает, что ответить?",
    answer: "Выдает мудрость: «Слабый ищет отмазки, сильный их уже придумал»",
  },
  {
    id: 22,
    category: "Реакции и повадки",
    question: "Какая самая характерная Женина реакция на неожиданную ситуацию?",
    answer: "«Как»",
  },
  {
    id: 23,
    category: "Реакции и повадки",
    question: "Что Женя никогда не признает, даже если все уже знают правду?",
    answer: "Правду",
  },
  {
    id: 24,
    category: "Реакции и повадки",
    question: "Какой поступок Жени друзья сочли бы абсолютно нормальным?",
    answer: "Поездку на море с Аней",
  },
  {
    id: 25,
    category: "Реакции и повадки",
    question: "Как Женя обычно реагирует, когда его будят рано утром?",
    answer: "Немножко негативно",
  },
];
